export const Rules = [
    {
        id: 1,
        classId: "general",
        name: "I. Общие правила сервера",
        rules: [
            {
                num: "1.1",
                content: "Вступая на сервер, пользователь соглашается со всеми правилами, изложенными ниже. В случае несогласия, пользователь обязуется прекратить использование сервисов проекта."
            },
            {
                num: "1.2",
                content: "Незнание правил не освобождает пользователя от ответственности. Взлом аккаунта не является оправданием, если игрок обвинён в нарушении правил."
            },
            {
                num: "1.3",
                content: "Запрещено угнетение игроков по любым признакам."
            },
            {
                num: "1.4",
                content: "Запрещено использование любой государственной символики в любых её проявлениях."
            }
        ]
    },
    {
        id: 2,
        classId: "chat",
        name: "II. Правила чата",
        rules: [
            {
                num: "2.1",
                content: "Запрещён капс(сообщения, содержащие более сорока процентов заглавных букв), флуд, спам и мат в любом его виде."
            },
            {
                num: "2.2",
                content: "Запрещены оскорбления в сторону пользователей и проекта."
            },
            {
                num: "2.3",
                content: "Запрещено заводить темы о политике и религии вне шуточного контекста."
            },
            {
                num: "2.4",
                content: "Запрещено рекламировать и упоминать существующие проекты, сервера и сайты, которые не имеют к нам отношения."
            },
            {
                num: "2.5",
                content: "Запрещены любые виды провокаций пользователей на конфликт."
            },
            {
                num: "2.6",
                content: "Запрещено вводить пользователей в заблуждение, выдавая им ложную информацию"
            },
            {
                num: "2.7",
                content: "Запрещено писать в чат бессмысленные наборы букв, символов и умышленно коверкать слова вне шуточного контекста."
            }
        ]
    },
    {
        id: 3,
        classId: "world",
        name: "III. Игровой мир",
        rules: [
            {
                num: "3.1",
                content: "Запрещено портить территорию других игроков (заливать водой, лавой, ломать блоки, топтать огород, убивать животных и иных существ, строиться вплотную к занятому участку без разрешения его владельца)."
            },
            {
                num: "3.2",
                content: "Запрещено убивать игроков или каким-либо образом навредить им без разрешения."
            },
            {
                num: "3.3",
                content: "Запрещено проводить розыгрыши и раздачи вещей без согласования с администрацией."
            },
            {
                num: "3.4",
                content: "Запрещено находиться на территории игрока и мешать игровому процессу, если владелец против."
            },
            {
                num: "3.5",
                content: "Запрещены любые виды дюпов."
            },
            {
                num: "3.6",
                content: "Запрещено портить, строить и ломать существующие структуры на основном острове в Краю без согласования с игроками в дискорде."
            },
            {
                num: "3.7",
                content: "Запрещено наполнять мир малосмысленными структурами (строить столбы, рыть ямы)."
            },
            {
                num: "3.8",
                content: "Запрещены любые постройки, которые могли бы нарушить работу сервера."
            },
            {
                num: "3.9",
                content: "Запрещено строительство в радиусе 300 блоков от спавна."
            },
            {
                num: "3.10",
                content: "Запрещено использование любых конструкций и механизмов для обхода ограничений на AFK на сервере."
            }
        ]
    },
    {
        id: 4,
        classId: "ban",
        name: "IV. Запрещенные программы",
        rules: [
            {
                num: "4.1",
                content: "Запрещено использовать любые виды читов, ресурс- и дата-паков, дающих несправедливое преимущество и влияющих на игровой процесс (прозрачные или выделяющиеся из окружения блоки, X-ray и т.д.)."
            },
            {
                num: "4.1.1",
                content: "Запрещено использование любых скриптов и ботов."
            },
            {
                num: "4.2",
                content: "Запрещено использование любого ПО для обхода ограничений на AFK на сервере."
            }
        ]
    },
    {
        id: 5,
        classId: "note",
        name: "V. Примечания. Общие правила сервера",
        rules: [
            {
                num: "5.1",
                content: "Для пресечения несанкционированных проникновений на свою территорию игроки имеют право использовать таблички, содержащие прямой запрет на вход, расположенные на видном месте."
            },
            {
                num: "5.2",
                content: "Игрок имеет право оттолкнуть рукой другого игрока в случае, если тот препятствует его проходу."
            },
            {
                num: "5.3",
                content: "Нанесение ущерба частной собственности при помощи мобов также является гриферством."
            },
            {
                num: "5.4",
                content: "Запрещена продажа внутриигрового имущества за реальные деньги."
            },
            {
                num: "5.5",
                content: "Администрация имеет право замьютить и заблокировать игрока за неадекватное поведение и троллинг."
            },
            {
                num: "5.6",
                content: "Администрация имеет право забрать у вас предмет, если он не соответствует правилам чата и вы его использовали в качестве убийства."
            },
            {
                num: "5.7",
                content: "Игрок имеет право на возврат ресурсов, если его смерть вызвана техническими проблемами сервера, о которых заранее не предупреждала администрация. В этом случае необходимо предоставить видеозапись момента смерти."
            }
        ]
    }
]